temp1/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникЗаказчики</name>
      <description>Контактная информация справочника &quot;Заказчики&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаЗаказчиков</name>
      <description>Контактная информация справочника &quot;Контактные лица заказчиков&quot;</description>
    </items>
    <items>
      <name>СправочникЛичныеАдресаты</name>
      <description>Контактная информация справочника &quot;Личные адресаты&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

temp1/src/CommonModules/ОбновлениеИнформационнойБазыСУЗ/Module.bsl
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
    Описание.Имя = "СистемаУчетаЗадач";
    Описание.Версия = "1.1.8.1";
    // Требуется библиотека стандартных подсистем.
    Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	// Обработчики, выполняемые при каждом обновлении ИБ.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.УправлениеОбработчиками = Истина;
	Обработчик.МонопольныйРежим = Истина; // Для демонстрации условного выполнения в монопольном режиме.
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУЗ.ВыполнятьВсегдаПриСменеВерсии";
	
	// Обработчики, выполняемые при заполнении пустой ИБ.
	
	Обработчик = Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыСУЗ.ПервыйЗапуск";
	
КонецПроцедуры

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
        Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
КонецПроцедуры
	
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
КонецПроцедуры 

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение пустой ИБ

Процедура ПервыйЗапуск() Экспорт
	
	//Константы.ОграничиватьКоличествоЗадачВРаботе.Установить(Истина);
	Константы.ЗаголовокСистемы.Установить("Система учета задач");
	Константы.КоличествоМесяцевДляОпределенияОсновногоИсполнителя.Установить(3);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обновление ИБ

Процедура ВыполнятьВсегдаПриСменеВерсии(Параметры = Неопределено) Экспорт
	
	КонтактнаяИнформацияОбновлениеИБ();
	
КонецПроцедуры

// Процедура обновления ИБ для справочника видов контактной информации
Процедура КонтактнаяИнформацияОбновлениеИБ() Экспорт
	
	ПользователиСлужебный.ОбновитьПредопределенныеВидыКонтактнойИнформацииПользователей();
	
	КонтактнаяИнформацияОбновлениеИБ_ВклГруппы(Справочники.ВидыКонтактнойИнформации.СправочникЗаказчики);
	КонтактнаяИнформацияОбновлениеИБ_ВклГруппы(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаЗаказчиков);
	КонтактнаяИнформацияОбновлениеИБ_ВклГруппы(Справочники.ВидыКонтактнойИнформации.СправочникЛичныеАдресаты);
	
    КонтактнаяИнформацияОбновлениеИБ_Email(Справочники.ВидыКонтактнойИнформации.EmailЗаказчика);
    КонтактнаяИнформацияОбновлениеИБ_Email(Справочники.ВидыКонтактнойИнформации.EmailКЛ);
    КонтактнаяИнформацияОбновлениеИБ_Email(Справочники.ВидыКонтактнойИнформации.EmailАдресата);
	
    КонтактнаяИнформацияОбновлениеИБ_Телефон(Справочники.ВидыКонтактнойИнформации.ТелефонЗаказчика);
    КонтактнаяИнформацияОбновлениеИБ_Телефон(Справочники.ВидыКонтактнойИнформации.ТелефонКЛ);
    КонтактнаяИнформацияОбновлениеИБ_Телефон(Справочники.ВидыКонтактнойИнформации.РабочийТелефонАдресата);
	
	КонтактнаяИнформацияОбновлениеИБ_Адрес(Справочники.ВидыКонтактнойИнформации.ФактическийАдресЗаказчика);
	КонтактнаяИнформацияОбновлениеИБ_Адрес(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресАдресата);
	
КонецПроцедуры

Процедура КонтактнаяИнформацияОбновлениеИБ_ВклГруппы(Знач Ссылка)
	
	Перем Объект;
	
	Объект = Ссылка.ПолучитьОбъект();
	Объект.Используется = Истина;
	Объект.Записать();

КонецПроцедуры

Процедура КонтактнаяИнформацияОбновлениеИБ_Email(Вид)
	
	Перем ПараметрыВида;
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Вид;
	ПараметрыВида.Используется = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.НастройкиПроверки.Вставить("ПроверятьКорректность", Истина);
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Процедура КонтактнаяИнформацияОбновлениеИБ_Телефон(Вид)
	
	Перем ПараметрыВида;
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Вид;
	ПараметрыВида.Используется = Истина;
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.НастройкиПроверки.Вставить("ПроверятьКорректность", Истина);
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Процедура КонтактнаяИнформацияОбновлениеИБ_Адрес(Вид)
	
	Перем ПараметрыВида;
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Вид;
	ПараметрыВида.Используется = Истина;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.НастройкиПроверки.Вставить("ПроверятьКорректность", Ложь);
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры
